nakhonthai/ESP32APRS_LoRa/src/main.cpp
    sprintf(config.digi_symbol, "/#");
    memset(config.digi_phg, 0, sizeof(config.digi_phg));
    sprintf(config.digi_comment, "DIGI MODE");

    // Tracker
    config.trk_en = false;
    config.trk_loc2rf = true;
    config.trk_loc2inet = false;
    config.trk_bat = false;
    config.trk_sat = false;
    config.trk_dx = false;
    config.trk_ssid = 7;
    config.trk_timestamp = false;
    sprintf(config.trk_mycall, "NOCALL");
    config.trk_path = 2;

    //--Position
    config.trk_gps = false;
    config.trk_lat = 13.7555;
    config.trk_lon = 100.4930;
    config.trk_alt = 0;
    config.trk_interval = 600;
    // Smart beacon
    config.trk_smartbeacon = true;
    config.trk_compress = true;
    config.trk_altitude = true;
    config.trk_cst = true;
    config.trk_hspeed = 120;
    config.trk_lspeed = 5;
    config.trk_maxinterval = 30;
    config.trk_mininterval = 5;
    config.trk_minangle = 25;
    config.trk_slowinterval = 600;

    sprintf(config.trk_symbol, "/[");
    sprintf(config.trk_symmove, "/>");
    sprintf(config.trk_symstop, "\\>");
    // sprintf(config.trk_btext, "");
    sprintf(config.trk_mycall, "NOCALL");
    sprintf(config.trk_comment, "TRACKER MODE");
    memset(config.trk_item, 0, sizeof(config.trk_item));

    // WX
    config.wx_en = false;
    config.wx_2rf = true;
    config.wx_2inet = true;
    config.wx_channel = 0;
    config.wx_ssid = 13;
    sprintf(config.wx_mycall, "NOCALL");
    config.wx_path = 8;
    sprintf(config.wx_comment, "WX MODE");
    memset(config.wx_object, 0, sizeof(config.wx_object));

    // Telemetry_0
    config.tlm0_en = false;
    config.tlm0_2rf = true;
    config.tlm0_2inet = true;
    config.tlm0_ssid = 0;
    sprintf(config.tlm0_mycall, "NOCALL");
    config.tlm0_path = 0;
    config.tlm0_data_interval = 600;
    config.tlm0_info_interval = 3600;
    sprintf(config.tlm0_PARM[0], "RF->INET");
    sprintf(config.tlm0_PARM[1], "INET->RF");
    sprintf(config.tlm0_PARM[2], "Repeater");
    sprintf(config.tlm0_PARM[3], "AllCount");
    sprintf(config.tlm0_PARM[4], "AllDrop");
    sprintf(config.tlm0_PARM[5], "IGATE");
    sprintf(config.tlm0_PARM[6], "DIGI");
    sprintf(config.tlm0_PARM[7], "WX");
    sprintf(config.tlm0_PARM[8], "SAT");
    sprintf(config.tlm0_PARM[9], "INET");
    sprintf(config.tlm0_PARM[10], "VPN");
    sprintf(config.tlm0_PARM[11], "4G");
    sprintf(config.tlm0_PARM[12], "MQTT");

    for (int i = 0; i < 5; i++)
    {
        sprintf(config.tlm0_UNIT[i], "Pkts");
        config.tlm0_EQNS[i][0] = 0; // a av2 + bv + c
        config.tlm0_EQNS[i][1] = 1; // b
        config.tlm0_EQNS[i][2] = 0; // c
    }
    sprintf(config.tlm0_UNIT[5], "En");
    sprintf(config.tlm0_UNIT[6], "En");
    sprintf(config.tlm0_UNIT[7], "En");
    sprintf(config.tlm0_UNIT[8], "En");
    sprintf(config.tlm0_UNIT[9], "ON");
    sprintf(config.tlm0_UNIT[10], "ON");
    sprintf(config.tlm0_UNIT[11], "ON");
    sprintf(config.tlm0_UNIT[12], "ON");
    config.tlm0_BITS_Active = 0xFF;
    config.tml0_data_channel[0] = 2;
    config.tml0_data_channel[1] = 3;
    config.tml0_data_channel[2] = 4;
    config.tml0_data_channel[3] = 1;
    config.tml0_data_channel[4] = 5;
    config.tml0_data_channel[5] = 1;
    config.tml0_data_channel[6] = 2;
    config.tml0_data_channel[7] = 3;
    config.tml0_data_channel[8] = 4;
    config.tml0_data_channel[9] = 5;
    config.tml0_data_channel[10] = 6;
    config.tml0_data_channel[11] = 7;
    config.tml0_data_channel[12] = 8;
    sprintf(config.tlm0_comment, "SYSTEM STATUS");

    //--Position
    config.wx_gps = false;
    config.wx_lat = 13.7555;
    config.wx_lon = 100.4930;
    config.wx_alt = 0;
    config.wx_interval = 600;
    config.wx_flage = 0;
    memset(config.wx_type, 0, sizeof(config.wx_type));

    // OLED DISPLAY
    config.oled_enable = true;
    config.oled_timeout = 60;
    config.dim = 0;
    config.contrast = 0;
    config.startup = 0;

    // Display
    config.dispDelay = 3; // Popup display 3 sec
    config.dispRF = true;
    config.dispINET = false;
    config.filterDistant = 0;
    config.dispFilter = 0xFFFF; // All filter
    config.h_up = false;
    config.tx_display = true;
    config.rx_display = true;

    // afsk,TNC
    sprintf(config.ntp_host, "ntp.dprns.com");

    sprintf(config.path[0], "WIDE1-1");
    sprintf(config.path[1], "WIDE1-1,WIDE2-1");
    sprintf(config.path[2], "TRACK3-3");
    sprintf(config.path[3], "RS0ISS");

    // VPN Wireguard
    config.vpn = false;
    config.wg_port = 51820;
    sprintf(config.wg_peer_address, "vpn.dprns.com");
    sprintf(config.wg_local_address, "192.168.1.2");
    sprintf(config.wg_netmask_address, "255.255.255.0");
    sprintf(config.wg_gw_address, "192.168.1.1");
    sprintf(config.wg_public_key, "");
    sprintf(config.wg_private_key, "");

    sprintf(config.http_username, "admin");
    sprintf(config.http_password, "admin");

    // config.gnss_baudrate = 9600;
    config.gnss_enable = false;
    // config.gnss_tx_gpio = 19;
    // config.gnss_rx_gpio = 18;
    // config.gnss_pps_gpio = -1;
    config.gnss_tcp_port = 8080;
    sprintf(config.gnss_tcp_host, "192.168.0.1");
    memset(config.gnss_at_command, 0, sizeof(config.gnss_at_command));

#ifdef CORE_DEBUG_LEVEL
    config.uart0_enable = true;
    config.uart0_baudrate = 115200;
    config.uart0_rx_gpio = 20;
    config.uart0_tx_gpio = 21;
    config.uart0_rts_gpio = -1;
#else
    config.uart0_enable = false;
    config.uart0_baudrate = 9600;
    config.uart0_rx_gpio = 3;
    config.uart0_tx_gpio = 1;
    config.uart0_rts_gpio = -1;
#endif

    config.uart1_enable = false;
    config.uart1_baudrate = 9600;
    config.uart1_rx_gpio = 18;
    config.uart1_tx_gpio = 19;
    config.uart1_rts_gpio = -1;

    // config.uart2_enable = false;
    // config.uart2_baudrate = 9600;
    // config.uart2_rx_gpio = 16;
    // config.uart2_tx_gpio = 17;
    // config.uart2_rts_gpio = -1;

    config.modbus_enable = false;
    config.modbus_de_gpio = -1;
    config.modbus_address = 0;
    config.modbus_channel = 0;

    config.onewire_enable = false;
    config.onewire_gpio = -1;
#ifdef OLED
    config.i2c_enable = true;
    config.i2c_sda_pin = 0;
    config.i2c_sck_pin = 1;
#else
    config.i2c_enable = false;
    config.i2c_sda_pin = -1;
    config.i2c_sck_pin = -1;
#endif

#ifdef TTGO_LORA32_V1
    config.rf_type = RF_SX1276;
    config.rf_tx_gpio = -1; // LORA ANTENNA TX ENABLE
    config.rf_rx_gpio = -1;
    config.rf_dio1_gpio = 26;
    config.rf_reset_gpio = 14;
    config.rf_busy_gpio = -1;
    config.rf_nss_gpio = 18;
    config.rf_sclk_gpio = 5;
    config.rf_miso_gpio = 19;
    config.rf_mosi_gpio = 27;
    config.rf_tx_active = 1;
    config.rf_rx_active = 1;
    config.rf_reset_active = 0;
    config.rf_nss_active = 0;
    config.uart0_rx_gpio = 3;
    config.uart0_tx_gpio = 1;
    config.i2c_enable = true;
    config.i2c_sda_pin = 15;
    config.i2c_sck_pin = 4;
#elif defined(HT_CT62)
    config.rf_type = RF_SX1262;
    config.rf_tx_gpio = -1; // LORA ANTENNA TX ENABLE
    config.rf_rx_gpio = -1;
    config.rf_dio1_gpio = 3;
    config.rf_reset_gpio = 5;
    config.rf_busy_gpio = 4;
    config.rf_nss_gpio = 8;
    config.rf_sclk_gpio = 10;
    config.rf_miso_gpio = 6;
    config.rf_mosi_gpio = 7;
    config.rf_tx_active = 1;
    config.rf_rx_active = 1;
    config.rf_reset_active = 0;
    config.rf_nss_active = 0;
#elif defined(ESP32_DIY_LoRa_GPS) || defined(TTGO_T_LORA32_V2_1_GPS)
    config.rf_tx_gpio = -1; // LORA ANTENNA TX ENABLE
    config.rf_rx_gpio = -1;
    config.rf_dio1_gpio = -1;
    config.rf_reset_gpio = 23;
    config.rf_busy_gpio = -1;
    config.rf_nss_gpio = 18;
    config.rf_sclk_gpio = 5;
    config.rf_miso_gpio = 19;
    config.rf_mosi_gpio = 27;
    config.rf_tx_active = 1;
    config.rf_rx_active = 1;
    config.rf_nss_active = 0;
    config.rf_reset_active = 0;
    config.gnss_enable = true;
    config.gnss_tx_gpio = 12;
    config.gnss_rx_gpio = 34;
#elif defined(TTGO_T_Beam_S3_SUPREME_V3)
    config.rf_tx_gpio = -1; // LORA ANTENNA TX ENABLE
    config.rf_rx_gpio = -1;
    config.rf_dio1_gpio = 40;
    config.rf_reset_gpio = 5;
    config.rf_busy_gpio = 4;
    config.rf_nss_gpio = 10;
    config.rf_sclk_gpio = 12;
    config.rf_miso_gpio = 13;
    config.rf_mosi_gpio = 11;
    config.rf_tx_active = 1;
    config.rf_rx_active = 1;
    config.rf_nss_active = 0;
    config.rf_reset_active = 0;
    config.gnss_enable = true;
    config.gnss_channel = 2;
    config.uart1_enable = true;
    config.uart1_baudrate = 9600;
    config.uart1_rx_gpio = 8;
    config.uart1_tx_gpio = 9;
    config.uart1_rts_gpio = -1;
    config.i2c_enable = true;
    config.i2c_sda_pin = 17;
    config.i2c_sck_pin = 18;
#elif defined(HELTEC_V3_GPS)
    config.rf_tx_gpio = -1; // LORA ANTENNA TX ENABLE
    config.rf_rx_gpio = -1;
    config.rf_dio1_gpio = 14;
    config.rf_reset_gpio = 12;
    config.rf_busy_gpio = 13;
    config.rf_nss_gpio = 8;
    config.rf_sclk_gpio = 9;
    config.rf_miso_gpio = 11;
    config.rf_mosi_gpio = 10;
    config.rf_tx_active = 1;
    config.rf_rx_active = 1;
    config.rf_nss_active = 0;
    config.rf_reset_active = 0;
    config.gnss_enable = true;
    config.gnss_tx_gpio = 20;
    config.gnss_rx_gpio = 19;
    config.i2c_enable = true;
    config.i2c_sda_pin = 17;
    config.i2c_sck_pin = 18;
    config.i2c_rst_pin = 21;
#elif defined(TTGO_T_Beam_V1_0_SX1268) || defined(TTGO_T_Beam_V1_2_SX1262)
    config.rf_tx_gpio = -1; // LORA ANTENNA TX ENABLE
    config.rf_rx_gpio = -1;
    config.rf_dio1_gpio = 33;
    config.rf_reset_gpio = 23;
    config.rf_busy_gpio = 32;
    config.rf_nss_gpio = 18;
    config.rf_sclk_gpio = 5;
    config.rf_miso_gpio = 19;
    config.rf_mosi_gpio = 27;
    config.rf_tx_active = 1;
    config.rf_rx_active = 1;
    config.rf_nss_active = 0;
    config.rf_reset_active = 0;
    config.gnss_enable = true;
    config.gnss_tx_gpio = 12;
    config.gnss_rx_gpio = 15;
    // config.i2c_enable = true;
    // config.i2c_sda_pin = 17;
    // config.i2c_sck_pin = 18;
    // config.i2c_rst_pin = 21;
#endif

    config.i2c_freq = 400000;
    config.i2c1_enable = false;
    config.i2c1_sda_pin = -1;
    config.i2c1_sck_pin = -1;
    config.i2c1_freq = 100000;

    config.counter0_enable = false;
    config.counter0_active = 0;
    config.counter0_gpio = -1;

    config.counter1_enable = false;
    config.counter1_active = 0;
    config.counter1_gpio = -1;

    config.ext_tnc_enable = false;
    config.ext_tnc_channel = 0;
    config.ext_tnc_mode = 2;

    sprintf(config.path[0], "TRACE2-2");
    sprintf(config.path[1], "WIDE1-1");
    sprintf(config.path[2], "WIDE1-1,WIDE2-1");
    sprintf(config.path[3], "RFONLY");

    config.pwr_en=false;
	config.pwr_mode=MODE_A; //A=Continue,B=Wait for receive,C=Send and sleep
	config.pwr_sleep_interval=600; //sec
	config.pwr_stanby_delay=300; //sec
	config.pwr_sleep_activate=ACTIVATE_TRACKER;

    saveEEPROM();
}

