nakhonthai/ESP32APRS_LoRa/src/main.cpp
void sendIsPkg(char *raw)
{
    char str[300];
    sprintf(str, "%s-%d>APE32L%s:%s", config.aprs_mycall, config.aprs_ssid, VERSION, raw);
    // client.println(str);
    String tnc2Raw = String(str);
    if (aprsClient.connected())
        aprsClient.println(tnc2Raw); // Send packet to Inet
    if (config.digi_en)
        pkgTxPush(str, strlen(str), 0);
}

void sendIsPkgMsg(char *raw)
{
    char str[300];
    char call[11];
    int i;
    memset(&call[0], 0, 11);
    if (config.aprs_ssid == 0)
        sprintf(call, "%s", config.aprs_mycall);
    else
        sprintf(call, "%s-%d", config.aprs_mycall, config.aprs_ssid);
    i = strlen(call);
    for (; i < 9; i++)
        call[i] = 0x20;

    if (config.aprs_ssid == 0)
        sprintf(str, "%s>APE32L::%s:%s", config.aprs_mycall, call, raw);
    else
        sprintf(str, "%s-%d>APE32L::%s:%s", config.aprs_mycall, config.aprs_ssid, call, raw);

    String tnc2Raw = String(str);
    if (aprsClient.connected())
        aprsClient.println(tnc2Raw); // Send packet to Inet
    // if (config.tnc && config.tnc_digi)
    //     pkgTxUpdate(str, 0);
    // APRS_sendTNC2Pkt(tnc2Raw); // Send packet to RF
}

void sendTelemetry_0(char *raw, bool header)
{
    char str[300];
    char call[11];
    int i;
    memset(&call[0], 0, 11);
    if (config.tlm0_ssid == 0)
        sprintf(call, "%s", config.tlm0_mycall);
    else
        sprintf(call, "%s-%d", config.tlm0_mycall, config.tlm0_ssid);
    i = strlen(call);
    for (; i < 9; i++)
        call[i] = 0x20;

    if (header)
    {
        if (config.tlm0_ssid == 0)
        {
            if (config.tlm0_path < 5)
            {
                if (config.tlm0_path > 0)
                    sprintf(str, "%s>APE32L-%d::%s:%s", config.tlm0_mycall, config.tlm0_path, call, raw);
                else
                    sprintf(str, "%s>APE32L::%s:%s", config.tlm0_mycall, call, raw);
            }
            else
            {
                sprintf(str, "%s>APE32L,%s::%s:%s", config.tlm0_mycall, getPath(config.tlm0_path).c_str(), call, raw);
            }
        }
        else
        {
            if (config.tlm0_path < 5)
            {
                if (config.tlm0_path > 0)
                    sprintf(str, "%s-%d>APE32L-%d::%s:%s", config.tlm0_mycall, config.tlm0_ssid, config.tlm0_path, call, raw);
                else
                    sprintf(str, "%s-%d>APE32L::%s:%s", config.tlm0_mycall, config.tlm0_ssid, call, raw);
            }
            else
            {
                sprintf(str, "%s-%d>APE32L,%s::%s:%s", config.tlm0_mycall, config.tlm0_ssid, getPath(config.tlm0_path).c_str(), call, raw);
            }
        }
    }
    else
    {
        if (config.tlm0_ssid == 0)
        {
            if (config.tlm0_path < 5)
            {
                if (config.tlm0_path > 0)
                    sprintf(str, "%s>APE32L-%d:%s", config.tlm0_mycall, config.tlm0_path, raw);
                else
                    sprintf(str, "%s>APE32L:%s", config.tlm0_mycall, raw);
            }
            else
            {
                sprintf(str, "%s>APE32L,%s:%s", config.tlm0_mycall, getPath(config.tlm0_path).c_str(), raw);
            }
        }
        else
        {
            if (config.tlm0_path < 5)
            {
                if (config.tlm0_path > 0)
                    sprintf(str, "%s-%d>APE32L-%d:%s", config.tlm0_mycall, config.tlm0_ssid, config.tlm0_path, raw);
                else
                    sprintf(str, "%s-%d>APE32L:%s", config.tlm0_mycall, config.tlm0_ssid, raw);
            }
            else
            {
                sprintf(str, "%s-%d>APE32L,%s:%s", config.tlm0_mycall, config.tlm0_ssid, getPath(config.tlm0_path).c_str(), raw);
            }
        }
    }

    if (config.tlm0_2rf)
    { // TLM SEND TO RF
        // char *rawP = (char *)malloc(rawData.length());
        //  rawData.toCharArray(rawP, rawData.length());
        // memcpy(rawP, rawData.c_str(), rawData.length());
        pkgTxPush(str, strlen(str), 0);
        // pushTxDisp(TXCH_RF, "TX DIGI POS", sts);
        // free(rawP);
    }
    if (config.tlm0_2inet)
    { // TLM SEND TO APRS-IS
        if (aprsClient.connected())
        {
            status.txCount++;
            aprsClient.printf("%s\r\n", str); // Send packet to Inet
            // pushTxDisp(TXCH_TCP, "TX DIGI POS", sts);
        }
    }
}

RTC_DATA_ATTR statusType statOld;
uint8_t getSensor(int ch)
{
    int val = 0;
    switch (ch)
    {
    case 0: // none
        val = 0;
        break;
    case 1: // allCount
        val = status.allCount - statOld.allCount;
        statOld.allCount = status.allCount;
        break;
    case 2: // rf2inet
        val = status.rf2inet - statOld.rf2inet;
        statOld.rf2inet = status.rf2inet;
        break;
    case 3: // inet2rf
        val = status.inet2rf - statOld.inet2rf;
        statOld.inet2rf = status.inet2rf;
        break;
    case 4: // digi
        val = status.digiCount - statOld.digiCount;
        statOld.digiCount = status.digiCount;
        break;
    case 5: // Drop
        val = status.dropCount - statOld.dropCount;
        statOld.dropCount = status.dropCount;
        break;
    }
    if (val < 0)
        val = 0;
    return val;
}

bool getBits(int ch)
{
    bool val = false;
    switch (ch)
    {
    case 0: // none
        val = 0;
        break;
    case 1: // IGATE Enable
        val = config.igate_en;
        break;
    case 2: // DIGI Enable
        val = config.digi_en;
        break;
    case 3: // WX Enable
        val = config.wx_en;
        break;
    case 4: // Sat Enable
        val = 0;
        break;
    case 5: // APRS-IS Status
        if (aprsClient.connected())
            val = 1;
        break;
    case 6: // VPN Status
        val = wireguard_active();
        break;
    case 7: // 4G LTE
        val = 0;
        break;
    case 8: // MQTT
        val = 0;
        break;
    }
    return val;
}

void getTelemetry_0()
{
    systemTLM.A1 = getSensor(config.tml0_data_channel[0]);
    systemTLM.A2 = getSensor(config.tml0_data_channel[1]);
    systemTLM.A3 = getSensor(config.tml0_data_channel[2]);
    systemTLM.A4 = getSensor(config.tml0_data_channel[3]);
    systemTLM.A5 = getSensor(config.tml0_data_channel[4]);
    systemTLM.BITS = 0;
    if (getBits(config.tml0_data_channel[5]))
        systemTLM.BITS |= 0x01;
    if (getBits(config.tml0_data_channel[6]))
        systemTLM.BITS |= 0x02;
    if (getBits(config.tml0_data_channel[7]))
        systemTLM.BITS |= 0x04;
    if (getBits(config.tml0_data_channel[8]))
        systemTLM.BITS |= 0x08;
    if (getBits(config.tml0_data_channel[9]))
        systemTLM.BITS |= 0x10;
    if (getBits(config.tml0_data_channel[10]))
        systemTLM.BITS |= 0x20;
    if (getBits(config.tml0_data_channel[11]))
        systemTLM.BITS |= 0x40;
    if (getBits(config.tml0_data_channel[12]))
        systemTLM.BITS |= 0x80;
}

String getPath(int idx)
{
    String ret = "";
    switch (idx)
    {
    case 0: // OFF
        ret = "";
        break;
    case 1: // DST-TRACE1
    case 2: // DST-TRACE2
    case 3: // DST-TRACE3
    case 4: // DST-TRACE4
        ret = "DST" + String(idx);
        break;
    case 5: // TRACE1-1
        ret = "TRACE1-1";
        break;
    case 6:
        ret = "TRACE2-2";
        break;
    case 7:
        ret = "TRACE3-3";
        break;
    case 8:
        ret = "WIDE1-1";
        break;
    case 9:
        ret = "RFONLY";
        break;
    case 10:
        ret = "RELAY";
        break;
    case 11:
        ret = "GATE";
        break;
    case 12:
        ret = "ECHO";
        break;
    case 13: // UserDefine1
        ret = String(config.path[0]);
        break;
    case 14: // UserDefine2
        ret = String(config.path[1]);
        break;
    case 15: // UserDefine3
        ret = String(config.path[2]);
        break;
    case 16: // UserDefine4
        ret = String(config.path[3]);
        break;
    default:
        ret = "WIDE1-1";
        break;
    }
    return ret;
}

void GPS_INIT()
{
    // SerialGPS.begin(config.gnss_baudrate, SERIAL_8N1, config.gnss_rx_gpio, config.gnss_tx_gpio);
    //  SerialGPS.begin(config.gnss_baudrate, EspSoftwareSerial::SWSERIAL_8N1, config.gnss_rx_gpio, config.gnss_tx_gpio);
    // SerialGPS.flush();
    //  while (SerialGPS.available() > 0)
    //      SerialGPS.read();
}

WiFiClient gnssClient;
// WiFiClient tncClient;
extern AsyncWebSocket ws_gnss;

void taskGPSActive()
{
    int c;
    // log_d("GNSS Init");
    nmea_idx = 0;

    // if (config.gnss_enable)
    // {
    //     if ((config.gnss_channel > 0) && (config.gnss_channel < 4))
    //     {
    //         if (strstr("AT", config.gnss_at_command) >= 0)
    //         {
    //             if (config.gnss_channel == 1)
    //             {
    //                 Serial.println(config.gnss_at_command);
    //             }
    //             else if (config.gnss_channel == 2)
    //             {
    //                 Serial1.println(config.gnss_at_command);
    //             }
    //             else if (config.gnss_channel == 3)
    //             {
    //                 Serial2.println(config.gnss_at_command);
    //             }
    //         }
    //     }
    // }
    // for (;;)
    {
        if (config.gnss_enable)
        {
            if ((config.gnss_channel > 0) && (config.gnss_channel < 4))
            {
                do
                {
                    c = -1;
                    if (config.gnss_channel == 1)
                    {
                        c = Serial.read();
                        
