nakhonthai/ESP32APRS_LoRa/src/main.cpp
                    }
                    else if (config.gnss_channel == 2)
                    {
                        c = Serial1.read();
                    }

                    if (c > -1)
                    {
                        gps.encode((char)c);
                        if (webServiceBegin == false)
                        {
                            if (nmea_idx > 399)
                            {
                                nmea_idx = 0;
                                memset(nmea, 0, sizeof(nmea));
                                // SerialGNSS->flush();
                            }
                            else
                            {
                                nmea[nmea_idx++] = (char)c;
                                if ((char)c == 0x0A || (char)c == 0x0D)
                                {
                                    //nmea[nmea_idx] = 0;
                                    if (nmea_idx > 10)
                                    {
                                        if (ws_gnss.enabled() && !ws_gnss.getClients().isEmpty())
                                        {
                                            handle_ws_gnss(nmea, nmea_idx);
                                        }
                                        log_d("[%d]:%s",nmea_idx,nmea);
                                    
                                    nmea_idx = 0;
                                    memset(nmea, 0, sizeof(nmea));
                                    }
                                    break;
                                }
                            }
                        }
                        //}
                    }
                    else
                    {
                        break;
                    }
                } while (1);
            }
            else if (config.gnss_channel == 4)
            { // TCP
                if (WiFi.isConnected())
                {
                    if (!gnssClient.connected())
                    {
                        gnssClient.connect(config.gnss_tcp_host, config.gnss_tcp_port);
                        log_d("GNSS TCP ReConnect to %s:%d", config.gnss_tcp_host, config.gnss_tcp_port);
                        delay(3000);
                    }
                    else
                    {
                        while (gnssClient.available())
                        {
                            c = (char)gnssClient.read();
                            // Serial.print(c);
                            gps.encode(c);
                            if (webServiceBegin == false)
                            {
                                if (nmea_idx > 195)
                                {
                                    nmea_idx = 0;
                                    memset(nmea, 0, sizeof(nmea));
                                }
                                else
                                {
                                    nmea[nmea_idx++] = c;
                                    if (c == '\r' || c == '\n')
                                    {
                                        nmea[nmea_idx] = 0;
                                        if (nmea_idx > 5)
                                        {
                                            if (ws_gnss.enabled() && !ws_gnss.getClients().isEmpty())
                                            {
                                                handle_ws_gnss(nmea, nmea_idx);
                                            }
                                            // log_d("%s",nmea);
                                        }
                                        nmea_idx = 0;
                                    }
                                }
                            }
                        }
                    }
                }
            }

            if (firstGpsTime && gps.time.isValid())
            {
                if (gps.time.isUpdated())
                {
                    time_t timeGps = getGpsTime(); // Local gps time
                    if (timeGps > 1700000000 && timeGps < 2347462800)
                    {
                        setTime(timeGps);
                        time_t rtc = timeGps;
                        timeval tv = {rtc, 0};
                        timezone tz = {TZ_SEC + DST_MN, 0};
                        settimeofday(&tv, &tz);
#ifdef DEBUG
                        log_d("\nSET GPS Timestamp = %u Year=%d\n", timeGps, year());
#endif
                        // firstGpsTime = false;
                        firstGpsTime = false;
                        if (startTime == 0)
                            startTime = now();
                    }
                    else
                    {
                        startTime = 0;
                    }
                }
            }
        }
    }
}

void taskGPS(void *pvParameters)
{
    int c;
    log_d("GNSS Init");
    nmea_idx = 0;

    if (config.gnss_enable)
    {
        if ((config.gnss_channel > 0) && (config.gnss_channel < 4))
        {
            if (strstr("AT", config.gnss_at_command) >= 0)
            {
                if (config.gnss_channel == 1)
                {
                    Serial.println(config.gnss_at_command);
                }
                else if (config.gnss_channel == 2)
                {
                    Serial1.println(config.gnss_at_command);
                }
                else if (config.gnss_channel == 3)
                {
                    // Serial2.println(config.gnss_at_command);
                }
            }
        }
    }
    for (;;)
    {
        timerGPS = micros() - timerGPS_old;
        vTaskDelay(10 / portTICK_PERIOD_MS);
        timerGPS_old = micros();

        if (config.gnss_enable)
        {
            if ((config.gnss_channel > 0) && (config.gnss_channel < 4))
            {
                do
                {
                    c = -1;
                    if (config.gnss_channel == 1)
                    {
                        c = Serial.read();
                    }
                    else if (config.gnss_channel == 2)
                    {
                        c = Serial1.read();
                    }
                    else if (config.gnss_channel == 3)
                    {
                        // c = Serial2.read();
                    }
                    if (c > -1)
                    {
                        gps.encode((char)c);
                        if (webServiceBegin == false)
                        {
                            if (nmea_idx > 99)
                            {
                                nmea_idx = 0;
                                memset(nmea, 0, sizeof(nmea));
                                // SerialGNSS->flush();
                            }
                            else
                            {
                                nmea[nmea_idx++] = (char)c;
                                if ((char)c == '\r' || (char)c == '\n')
                                {
                                    //nmea[nmea_idx] = 0;
                                    if (nmea_idx > 10)
                                    {
                                        // if (webServiceBegin == false)
                                        if (ws_gnss.enabled() && !ws_gnss.getClients().isEmpty())
                                        {
                                            if(ws_gnss.availableForWriteAll()){
                                                handle_ws_gnss(nmea, nmea_idx);
                                            }
                                        }
                                        //log_d("[%d]:%s",nmea_idx,nmea);
                                    }
                                    nmea_idx = 0;
                                    memset(nmea, 0, sizeof(nmea));
                                    vTaskDelay(50 / portTICK_PERIOD_MS);
                                    break;
                                }
                            }
                        }
                        //}
                    }
                    else
                    {
                        break;
                    }
                } while (1);
            }
            else if (config.gnss_channel == 4)
            { // TCP
                if (WiFi.isConnected())
                {
                    if (!gnssClient.connected())
                    {
                        IPAddress ip;
                        ip.fromString(config.gnss_tcp_host);
                        gnssClient.connect(ip, config.gnss_tcp_port, 5000);
                        log_d("GNSS TCP ReConnect to %s:%d", config.gnss_tcp_host, config.gnss_tcp_port);
                        delay(5000);
                    }
                    else
                    {
                        while (gnssClient.available())
                        {
                            c = (char)gnssClient.read();
                            // Serial.print(c);
                            gps.encode(c);
                            if (webServiceBegin == false)
                            {
                                if (nmea_idx > 99)
                                {
                                    nmea_idx = 0;
                                    memset(nmea, 0, sizeof(nmea));
                                }
                                else
                                {
                                    nmea[nmea_idx++] = c;
                                    if (c == '\r' || c == '\n')
                                    {
                                        //nmea[nmea_idx] = 0;
                                        if (nmea_idx > 10)
                                        {
                                            // if (webServiceBegin == false)
                                            if (ws_gnss.enabled() && !ws_gnss.getClients().isEmpty())
                                            {
                                                handle_ws_gnss(nmea, nmea_idx);
                                            }
                                            // log_d("%s",nmea);
                                        }
                                        nmea_idx = 0;
                                        memset(nmea, 0, sizeof(nmea));
                                    }
                                }
                            }
                        }
                    }
                }
            }

