nakhonthai/ESP32APRS_LoRa/src/main.cpp
            if (firstGpsTime && gps.time.isValid())
            {
                if (gps.time.isUpdated())
                {
                    time_t timeGps = getGpsTime(); // Local gps time
                    if (timeGps > 1700000000 && timeGps < 2347462800)
                    {
                        setTime(timeGps);
                        time_t rtc = timeGps;
                        timeval tv = {rtc, 0};
                        timezone tz = {TZ_SEC + DST_MN, 0};
                        settimeofday(&tv, &tz);
#ifdef DEBUG
                        log_d("\nSET GPS Timestamp = %u Year=%d\n", timeGps, year());
#endif
                        // firstGpsTime = false;
                        firstGpsTime = false;
                        if (startTime == 0)
                            startTime = now();
                    }
                    else
                    {
                        startTime = 0;
                    }
                }
            }
        }
    }
}

void taskSerial(void *pvParameters)
{
    String raw;
    int c;
    char rawP[500];
    char call[11];
    log_d("Serial task Init");
    nmea_idx = 0;
    if (config.ext_tnc_enable)
    {
        if (config.ext_tnc_channel == 1)
        {
            Serial.setTimeout(10);
        }
        else if (config.ext_tnc_channel == 2)
        {
            Serial1.setTimeout(10);
        }
        else if (config.ext_tnc_channel == 3)
        {
            // Serial2.setTimeout(10);
        }
    }
    if (config.wx_en)
    {
        if (config.wx_channel == 1)
        {
            Serial.setTimeout(10);
        }
        else if (config.wx_channel == 2)
        {
            Serial1.setTimeout(10);
        }
        else if (config.wx_channel == 3)
        {
            // Serial2.setTimeout(10);
        }
    }
    for (;;)
    {
        timerSerial = millis() - timerSerial_old;
        vTaskDelay(10 / portTICK_PERIOD_MS);
        timerSerial_old = micros();

        if (config.wx_en)
        {
            if (config.wx_channel > 0 && config.wx_channel < 4)
            {
                String wx = "";
                if (config.wx_channel == 1)
                {
                    wx = Serial.readString();
                }
                else if (config.wx_channel == 2)
                {
                    wx = Serial1.readString();
                }
                else if (config.wx_channel == 3)
                {
                    // wx = Serial2.readString();
                }
                // if (wx!="")
                //{
                // while (SerialWX->available())
                //{
                // String wx = SerialWX->readString();
                if (wx != "" && wx.indexOf("DATA:") >= 0)
                {
                    log_d("WX Raw >> %d", wx.c_str());
                    getCSV2Wx(wx);
                }
                //}
                //}
            }
            // else if(config.wx_channel == 4){
            //     bool result=getM702Modbus(modbus);
            // }
        }

        if (config.ext_tnc_enable && (config.ext_tnc_mode > 0 && config.ext_tnc_mode < 4))
        {
            if (config.ext_tnc_mode == 1)
            { // KISS
                // KISS MODE
                do
                {
                    c = -1;
                    if (config.ext_tnc_channel == 1)
                    {
                        c = Serial.read();
                    }
                    else if (config.ext_tnc_channel == 2)
                    {
                        c = Serial1.read();
                    }
                    else if (config.ext_tnc_channel == 3)
                    {
                        // c = Serial2.read();
                    }

                    if (c > -1)
                        kiss_serial((uint8_t)c);
                    else
                        break;
                } while (c > -1);
            }
            else if (config.ext_tnc_mode == 2)
            { // TNC2RAW
                raw.clear();
                if (config.ext_tnc_channel == 1)
                {
                    raw = Serial.readStringUntil(0x0D);
                }
                else if (config.ext_tnc_channel == 2)
                {
                    raw = Serial1.readStringUntil(0x0D);
                }
                else if (config.ext_tnc_channel == 3)
                {
                    // raw = Serial2.readStringUntil(0x0D);
                }

                log_d("Ext TNC2RAW RX:%s", raw.c_str());
                String src_call = raw.substring(0, raw.indexOf('>'));
                if ((src_call != "") && (src_call.length() < 10) && (raw.length() < sizeof(rawP)))
                {
                    memset(call, 0, sizeof(call));
                    strcpy(call, src_call.c_str());
                    strcpy(rawP, raw.c_str());
                    uint16_t type = pkgType((const char *)rawP);
                    pkgListUpdate(call, rawP, type, 1);
                    if (config.rf2inet && aprsClient.connected())
                    {
                        // RF->INET
                        aprsClient.write(&rawP[0], strlen(rawP)); // Send binary frame packet to APRS-IS (aprsc)
                        aprsClient.write("\r\n");                 // Send CR LF the end frame packet
                        status.rf2inet++;
                        igateTLM.RF2INET++;
                        igateTLM.RX++;
                    }
                }
            }
            else if (config.ext_tnc_mode == 3)
            { // YAESU FTM-350,FTM-400
                String info = "";
                if (config.ext_tnc_channel == 1)
                {
                    info = Serial.readString();
                }
                else if (config.ext_tnc_channel == 2)
                {
                    info = Serial1.readString();
                }
                else if (config.ext_tnc_channel == 3)
                {
                    // info = Serial2.readString();
                }

