nakhonthai/ESP32APRS_LoRa/src/main.cpp
                //  log_d("Ext Yaesu Packet >> %s",info.c_str());
                int ed = info.indexOf(" [");
                if (info != "" && ed > 10)
                {
                    raw.clear();
                    raw = info.substring(0, ed);
                    int st = info.indexOf(">:");
                    if (st > ed)
                    {
                        int idx = 0;
                        st += 2;
                        for (int i = 0; i < 5; i++)
                        {
                            if (info.charAt(st + i) == 0x0A || info.charAt(st + i) == 0x0D)
                            {
                                idx++;
                            }
                            else
                            {
                                break;
                            }
                        }
                        st += idx;
                        ed = info.indexOf(0x0D, st + 1);
                        if (ed > info.length())
                            ed = info.length();
                        if (ed > st)
                        {
                            raw += ":" + info.substring(st, ed);

                            String src_call = raw.substring(0, raw.indexOf('>'));
                            if ((src_call != "") && (src_call.length() < 11) && (raw.length() < sizeof(rawP)))
                            {
                                memset(call, 0, sizeof(call));
                                strcpy(call, src_call.c_str());
                                memset(rawP, 0, sizeof(rawP));
                                strcpy(rawP, raw.c_str());
                                log_d("Yaesu Packet: CallSign:%s RAW:%s", call, rawP);
                                // String hstr="";
                                // for(int i=0;i<raw.length();i++){
                                //     hstr+=" "+String(rawP[i],HEX);
                                // }
                                // log_d("HEX: %s",hstr.c_str());
                                uint16_t type = pkgType((const char *)rawP);
                                pkgListUpdate(call, rawP, type, 1);
                                if (config.rf2inet && aprsClient.connected())
                                {
                                    // RF->INET
                                    aprsClient.write(&rawP[0], strlen(rawP)); // Send binary frame packet to APRS-IS (aprsc)
                                    aprsClient.write("\r\n");                 // Send CR LF the end frame packet
                                    status.rf2inet++;
                                    igateTLM.RF2INET++;
                                    igateTLM.RX++;
                                }
                            }
                        }
                    }
                }
            }
            //}
        }
    }
}

long timeSlot;
unsigned long iGatetickInterval;
bool initInterval = true;
void taskAPRS(void *pvParameters)
{
    //	long start, stop;
    char sts[50];
    // char *raw;
    // char *str;
    unsigned long tickInterval = 0;
    unsigned long DiGiInterval = 0;

    Serial.println("Task APRS has been start");
    PacketBuffer.clean();

    // afskSetModem(config.modem_type);
    // afskSetSQL(config.rf_sql_gpio, config.rf_sql_active);
    // afskSetPTT(config.rf_ptt_gpio, config.rf_ptt_active);
    // afskSetPWR(config.rf_pwr_gpio, config.rf_pwr_active);
    // afskSetDCOffset(config.adc_dc_offset);
    // afskSetADCAtten(config.adc_atten);
    APRS_init(&config);
    // APRS_setFreq(config.rf_freq);
    APRS_setCallsign(config.aprs_mycall, config.aprs_ssid);
    // APRS_setPath1("WIDE1-1", 1);
    // APRS_setPreamble(300);
    // APRS_setTail(0);
    sendTimer = millis() - (config.igate_interval * 1000) + 30000;
    igateTLM.TeleTimeout = millis() + 60000; // 1Min

    timeSlot = millis();
    timeAprs = 0;
    // afskSetHPF(config.audio_hpf);
    // afskSetBPF(config.audio_bpf);
    timeSlot = millis();
    tx_interval = config.trk_interval;
    tx_counter = tx_interval - 10;
    initInterval = true;
    AFSKInitAct = true;
    Serial.println("Task APRS init susses....");
    for (;;)
    {
        long now = millis();
        // wdtSensorTimer = now;
        time_t timeStamp;
        time(&timeStamp);
        if (initInterval)
        {
            tickInterval = DiGiInterval = iGatetickInterval = millis() + 10000;
            systemTLM.ParmTimeout = millis() + 20000;
            systemTLM.TeleTimeout = millis() + 30000;
            initInterval = false;
            tx_interval = config.trk_interval;
            tx_counter = tx_interval - 10;
        }
        timerAPRS = micros() - timerAPRS_old;
        vTaskDelay(10 / portTICK_PERIOD_MS);
        timerAPRS_old = micros();

        // if (config.rf_en)
        { // RF Module enable
            // SEND RF in time slot
            if (now > (timeSlot + 10))
            {
                // Transmit in timeslot if enabled
                // if (config.rf_sql_gpio > -1)
                // { // Set SQL pin
                //     if (digitalRead(config.rf_sql_gpio) ^ config.rf_sql_active)
                //     { // RX State Fail
                //         if (pkgTxSend())
                //             timeSlot = millis() + config.tx_timeslot; // Tx Time Slot >2sec.
                //         else
                //             timeSlot = millis() + 3000;
                //     }
                //     else
                //     {
                //         timeSlot = millis() + 1500;
                //     }
                // }
                // else
                if (pkgTxSend())
                    //     timeSlot = millis() + config.tx_timeslot; // Tx Time Slot > 2sec.
                    // else
                    timeSlot = millis() + 2000;
            }
        }

        if (config.trk_en)
        { // TRACKER MODE

            if (millis() > tickInterval)
            {
                tickInterval = millis() + 1000;

                tx_counter++;
                // log_d("TRACKER tx_counter=%d\t INTERVAL=%d\n", tx_counter, tx_interval);
                //   Check interval timeout
                if (config.trk_smartbeacon && config.trk_gps)
                {
                    if (tx_counter > tx_interval)
                    {
                        if (tx_counter > config.trk_mininterval)
                            EVENT_TX_POSITION = 4;
                    }
                    else
                    {
                        if (tx_counter >= (tx_interval + 5))
                        {
                            EVENT_TX_POSITION = 5;
                        }
                    }
                }
                else if (tx_counter > tx_interval)
                {
                    EVENT_TX_POSITION = 6;
                    tx_interval = config.trk_interval;
                }

                // if (config.trk_gps && gps.speed.isValid() && gps.location.isValid() && gps.course.isValid() && (gps.hdop.hdop() < 10.0) && (gps.satellites.value() > 3))
                // if (config.trk_gps && gps.speed.isValid() && gps.location.isValid() && gps.course.isValid())
                if (config.trk_gps)
                {
                    SB_SPEED_OLD = SB_SPEED;
                    // if (gps.speed.isUpdated())
                    SB_SPEED = (unsigned char)gps.speed.kmph();
                    // if (gps.course.isUpdated())
                    if (gps.speed.kmph() > config.trk_lspeed)
                        SB_HEADING = (int16_t)gps.course.deg();
                    if (config.trk_smartbeacon) // SMART BEACON CAL
                    {
                        if (SB_SPEED < config.trk_lspeed && SB_SPEED_OLD > config.trk_lspeed) // Speed slow down to STOP
                        {                                                                     // STOPING
                            SB_SPEED_OLD = 0;
                            if (tx_counter > config.trk_mininterval)
                                EVENT_TX_POSITION = 7;
                            tx_interval = config.trk_slowinterval;
                        }
                        else
                        {
                            smartbeacon();
                        }
                    }
                    else if (tx_counter > tx_interval)
                    { // send gps location
                        EVENT_TX_POSITION = 8;
                        tx_interval = config.trk_interval;
                    }
                }
            }

            if (EVENT_TX_POSITION > 0)
            {
                String rawData;
                String cmn = "";
                if(config.trk_bat)
                    cmn += "BAT:"+String(VBat,2)+"V ";
                if (config.trk_sat)
                    cmn += "SAT:" + String(gps.satellites.value()) + ",HDOP:" + String(gps.hdop.hdop(), 1);
                // if (config.trk_bat)
                // {
                // if (config.trk_sat)
                //     cmn += ",";
                // // cmn += "BAT:" + String((float)PMU.getBattVoltage() / 1000, 1) + "V";
                // cmn += "BAT:" + String(vbat, 1) + "V";
                // }
                if (config.trk_gps) // TRACKER by GPS
                {
                    rawData = trk_gps_postion(cmn);
                }
                else // TRACKER by FIX position
                {
                    rawData = trk_fix_position(cmn);
                }

