nakhonthai/ESP32APRS_LoRa/src/main.cpp
                log_d("TRACKER RAW: %s\n", rawData.c_str());
                log_d("TRACKER EVENT_TX_POSITION=%d\t INTERVAL=%d\n", EVENT_TX_POSITION, tx_interval);
                tx_counter = 0;
                EVENT_TX_POSITION = 0;
                last_heading = SB_HEADING;

                if (config.trk_gps)
                {
                    // if (gps.location.isValid() && (gps.hdop.hdop() < 10.0))
                    sprintf(sts, "POSITION GPS\nSPD %dkPh/%d\nINTERVAL %ds", SB_SPEED, SB_HEADING, tx_interval);
                    // else
                    //     sprintf(sts, "POSITION GPS\nGPS INVALID\nINTERVAL %ds", tx_interval);
                }
                else
                {
                    sprintf(sts, "POSITION FIX\nINTERVAL %ds", tx_interval);
                }

                if (config.trk_loc2rf)
                { // TRACKER SEND TO RF
                    char *rawP = (char *)calloc(rawData.length(), sizeof(char));
                    memcpy(rawP, rawData.c_str(), rawData.length());
                    // rawData.toCharArray(rawP, rawData.length());
                    pkgTxPush(rawP, rawData.length(), 0);
#ifdef OLED
                    pushTxDisp(TXCH_RF, "TX TRACKER", sts);
#endif
                    free(rawP);
                }
                if (config.trk_loc2inet)
                { // TRACKER SEND TO APRS-IS
                    if (aprsClient.connected())
                    {
                        aprsClient.println(rawData); // Send packet to Inet
#ifdef OLED
                        pushTxDisp(TXCH_TCP, "TX TRACKER", sts);
#endif
                    }
                }
                rawData.clear();
                cmn.clear();
            }
        }

        // LOAD DATA incomming
        bool newIGatePkg = false;
        bool newDigiPkg = false;
        if (PacketBuffer.getCount() > 0)
        {
            String tnc2;
            // นำข้อมูลแพ็จเกจจาก TNC ออกจากคิว
            PacketBuffer.pop(&incomingPacket);
            // igateProcess(incomingPacket);
            packet2Raw(tnc2, incomingPacket);
            newIGatePkg = true;
            newDigiPkg = true;
            if (config.ext_tnc_enable)
            {
                if (config.ext_tnc_channel > 0 && config.ext_tnc_channel < 3)
                {
                    if (config.ext_tnc_mode == 1)
                    {
                        // KISS MODE
                        uint8_t pkg[500];
                        int sz = kiss_wrapper(pkg);
                        if (config.ext_tnc_channel == 1)
                        {
                            Serial.write(pkg, sz);
                        }
                        else if (config.ext_tnc_channel == 2)
                        {
                            Serial1.write(pkg, sz);
                        }
                        else if (config.ext_tnc_channel == 3)
                        {
                            // Serial2.write(pkg, sz);
                        }
                    }
                    else if (config.ext_tnc_mode == 2)
                    {
                        // TNC2
                        if (config.ext_tnc_channel == 1)
                        {
                            Serial.println(tnc2);
                        }
                        else if (config.ext_tnc_channel == 2)
                        {
                            Serial1.println(tnc2);
                        }
                        else if (config.ext_tnc_channel == 3)
                        {
                            // Serial2.println(tnc2);
                        }
                    }
                }
            }
#ifdef BLUETOOTH
            if (config.bt_master)
            { // Output TNC2RAW to BT Serial
              // SerialBT.println(tnc2);
                if (config.bt_mode == 1)
                {
                    char *rawP = (char *)malloc(tnc2.length());
                    memcpy(rawP, tnc2.c_str(), tnc2.length());
                    SerialBT.write((uint8_t *)rawP, tnc2.length());
                    // pTxCharacteristic->setValue((uint8_t *)rawP, tnc2.length());
                    // pTxCharacteristic->notify();
                    free(rawP);
                }
                else if (config.bt_mode == 2)
                { // KISS
                    uint8_t pkg[500];
                    int sz = kiss_wrapper(pkg);
                    SerialBT.write(pkg, sz);
                    // pTxCharacteristic->setValue(pkg, sz);
                    // pTxCharacteristic->notify();
                }
            }
#endif
            log_d("RX: %s", tnc2.c_str());

            // SerialBT.println(tnc2);
            uint16_t type = pkgType((char *)incomingPacket.info);
            char call[11];
            if (incomingPacket.src.ssid > 0)
                sprintf(call, "%s-%d", incomingPacket.src.call, incomingPacket.src.ssid);
            else
                sprintf(call, "%s", incomingPacket.src.call);

            char *rawP = (char *)calloc(tnc2.length(), sizeof(char));
            memcpy(rawP, tnc2.c_str(), tnc2.length());
            int idx = pkgListUpdate(call, rawP, type, 0);
            free(rawP);
#ifdef OLED
            if (idx > -1)
            {

                if (config.rx_display && config.dispRF && (type & config.dispFilter))
                {
                    dispBuffer.push(tnc2.c_str());
                    log_d("RF_putQueueDisp:[pkgList_idx=%d,Type=%d] %s\n", idx, type, call);
                }
            }
#endif
            lastPkg = true;
            lastPkgRaw = tnc2;
            handle_ws();
            // ESP_BT.println(tnc2);
            status.allCount++;
            tnc2.clear();
        }

        // IGate Process
        if (config.igate_en)
        {
            // IGATE Position
            if (config.igate_bcn)
            {
                if (millis() > iGatetickInterval)
                {

                    String rawData = "";
                    if (config.igate_gps)
                    { // IGATE Send GPS position
                        if (gps.location.isValid())
                            rawData = igate_position(gps.location.lat(), gps.location.lng(), gps.altitude.meters(), "");
                    }
                    else
                    { // IGATE Send fix position
                        rawData = igate_position(config.igate_lat, config.igate_lon, config.igate_alt, "");
                    }
                    if (rawData != "")
                    {
                        iGatetickInterval = millis() + (config.igate_interval * 1000);
                        log_d("IGATE_POSITION: %s", rawData.c_str());

                        if (config.igate_gps)
                            sprintf(sts, "POSITION GPS\nINTERVAL %ds", tx_interval);
                        else
                            sprintf(sts, "POSITION FIX\nINTERVAL %ds", tx_interval);
                        if (config.igate_loc2rf)
                        { // IGATE SEND POSITION TO RF
                            char *rawP = (char *)calloc(rawData.length(), sizeof(char));
                            // rawData.toCharArray(rawP, rawData.length());
                            memcpy(rawP, rawData.c_str(), rawData.length());
                            pkgTxPush(rawP, rawData.length(), 0);
#ifdef OLED
                            pushTxDisp(TXCH_RF, "TX IGATE", sts);
#endif
                            free(rawP);
                        }
                        if (config.igate_loc2inet)
                        { // IGATE SEND TO APRS-IS
                            if (aprsClient.connected())
                            {
                                status.txCount++;
                                aprsClient.println(rawData); // Send packet to Inet
#ifdef OLED
                                pushTxDisp(TXCH_TCP, "TX IGATE", sts);
#endif
                            }
                        }
                    }
                }
            }
            // IGATE send to inet
            if (newIGatePkg)
            {
                newIGatePkg = false;
                if (config.rf2inet && aprsClient.connected())
                {
                    int ret = 0;
                    uint16_t type = pkgType((const char *)&incomingPacket.info[0]);
                    // IGate Filter RF->INET
                    if ((type & config.rf2inetFilter))
                        ret = igateProcess(incomingPacket);
                    if (ret == 0)
                    {
                        status.dropCount++;
                        igateTLM.DROP++;
                    }
                    else
                    {
                        status.rf2inet++;
                        igateTLM.RF2INET++;
                        igateTLM.TX++;
                    }
                }
            }
        }

        // Digi Repeater Process
        if (config.digi_en)
        {
            // DIGI Position
            if (config.digi_bcn)
            {
                if (millis() > DiGiInterval)
                {

